---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.Vertex.Dispose
source: html/b008eaa1-66a2-8e56-34e5-82b879047a97.htm
---
# Autodesk.Revit.DB.DirectContext3D.Vertex.Dispose Method

Releases all resources used by the Vertex

## Syntax (C#)
```csharp
public void Dispose()
```